posts/fx-series-history/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>fx-series-history | SQS</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link href="https://fonts.googleapis.com/css?family=Playfair+Display:700,900" rel="stylesheet">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" hreflang="en" href="../../rss.xml">
<link rel="canonical" href="https://kelianf.github.io/posts/fx-series-history/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Kelian">
<link rel="prev" href="../starting-an-application-with-a-specified-number-of-core/" title="Starting an application with a specified number of core" type="text/html">
<meta property="og:site_name" content="SQS">
<meta property="og:title" content="fx-series-history">
<meta property="og:url" content="https://kelianf.github.io/posts/fx-series-history/">
<meta property="og:description" content="Exchange Rate Agreement


This is the framework in which a monetary authority namages its currency in relation to other currencies. All the different FX rate can be compartimentized in 4 categories ac">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2022-01-02T07:33:16-05:00">
<meta property="article:tag" content="Finance">
<meta property="article:tag" content="FX">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Header and menu bar -->
<div class="container">
      <header class="blog-header py-3"><div class="row nbb-header align-items-center">
          <div class="col-md-3 col-xs-2 col-sm-2" style="width: auto;">
            <button class="navbar-toggler navbar-light bg-light nbb-navbar-toggler" type="button" data-toggle="collapse" data-target=".bs-nav-collapsible" aria-controls="bs-navbar" aria-expanded="false" aria-label="Toggle navigation">
                <span class="navbar-toggler-icon"></span>
            </button>
            <div class="collapse bs-nav-collapsible bootblog4-search-form-holder">
                
            </div>
        </div>
          <div class="col-md-6 col-xs-10 col-sm-10 bootblog4-brand" style="width: auto;">
            <a class="navbar-brand blog-header-logo text-dark" href="../../">

            <span id="blog-title">SQS</span>
        </a>
          </div>
            <div class="col-md-3 justify-content-end align-items-center bs-nav-collapsible collapse flex-collapse bootblog4-right-nav">
            <nav class="navbar navbar-light bg-white"><ul class="navbar-nav bootblog4-right-nav">
<li class="nav-item">
    <a href="index.org" id="sourcelink" class="nav-link">Source</a>
    </li>


                    
            </ul></nav>
</div>
    </div>
</header><nav class="navbar navbar-expand-md navbar-light bg-white static-top"><div class="collapse navbar-collapse bs-nav-collapsible" id="bs-navbar">
            <ul class="navbar-nav nav-fill d-flex w-100">
<li class="nav-item">
<a href="../../archive.html" class="nav-link">Archive</a>
                </li>
<li class="nav-item">
<a href="../../categories/" class="nav-link">Tags</a>
                </li>
<li class="nav-item">
<a href="../../rss.xml" class="nav-link">RSS feed</a>

                
            </li>
</ul>
</div>
<!-- /.navbar-collapse -->
</nav>
</div>

<div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        
        
        
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">fx-series-history</a></h1>

        <div class="metadata">
            <p class="byline author vcard p-author h-card"><span class="byline-name fn p-name" itemprop="author">
                    Kelian
            </span></p>
            <p class="dateline">
            <a href="." rel="bookmark">
            <time class="published dt-published" datetime="2022-01-02T07:33:16-05:00" itemprop="datePublished" title="2022-01-02 07:33">2022-01-02 07:33</time></a>
            </p>
                <p class="commentline">
        


            
        </p>
<p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-org5bfbe4c" class="outline-2">
<h2 id="org5bfbe4c">Exchange Rate Agreement</h2>
<div class="outline-text-2" id="text-org5bfbe4c">
<p>
This is the framework in which a monetary authority namages its currency in relation to other currencies. All the different FX rate can be compartimentized in 4 categories according the the IMF: hard peg, soft peg, free floating and residual.
</p>

<p>
The main monetary authority for each currency would be represented by a central bank. The primary objectives of a central bank are:
</p>
<ul class="org-ul">
<li>Monitoring and managing monetary and credit conditions (through monetary policy)</li>
<li>The pursuit of full or maximum level of employment</li>
<li>Maintaining stable prices</li>
<li>Preserving the purchasing power of the currency (reducing vol of fx rate)</li>
<li>Issuing bank notes or currency consistent with economic policy</li>
<li>Encouraging moderate long terminterest rates or controlling the money supply</li>
<li>Promoting real or sustainable economic growth and development</li>
<li>Improving welfare of its citizens</li>
<li>Ensuring the soundness and stability of the banking and financial system</li>
<li>Providing Financial Services</li>
<li>Supporting smooth operation of the payment system</li>
</ul>
<p>
One of the biggest shift in the history of the FX market is the creation of the Euro currency.
Thus here is a quick revie of the conditions set by the ECB to join it:
</p>
<ul class="org-ul">
<li>Price stability: The inflation rate cannot be higher than 1.5% above the ratee of the three best-performing memeber state</li>
<li>Sound and sustainable public finance: The country should not be under the excessive deficit procedure</li>
<li>Exchange-rate stability: The country has to participate in the Exchange Rate Mechanism (ERM II) for at least two years, without strong deviations from the ERM central rate and without devaluing its currency bilateral central rate against the euro in the same period</li>
<li>Long term interest rate: The long term interest rate should not be higher than 2% above the rate of the three best performing member state in term of price stability</li>
</ul>
</div>
</div>

<div id="outline-container-orgb5d8770" class="outline-2">
<h2 id="orgb5d8770">Brief history of the FX Market</h2>
<div class="outline-text-2" id="text-orgb5d8770">
<p>
The recent history of the FX Market can be divided into five major periods:
1800's - 1914:  Classical Gold Standard
1914 - 1943:    Interim instability
1944 - 1973:    Bretton Woods system
1973 - present: Recent float
</p>

<p>
Chronology:
</p>

<p>
1820: Britain adopted Gold standard
1871: Germany adopted Gold standard
1876: France adopted Gold standard
1879: USA adopted Gold standard
</p>

<p>
1914 - 1918: WWI, $1 was worth 8 Marks at that time
Nov 1923: Germany debased its currency to repay its reparation payment, t that time $1 = 4.2 trillion Marks
1933 : 25% of US workforce unemployed; US Presidend abandonned Gold standard; US pegged the price of Gold to $35 per ounce, the peg remained until 1971
Jul 1944: Bretton Woods Conference, led to the creation of the IMF and the International Bank for Reconstruction and Development (which later became the WorldBank and BIS)
1967: GBP Devaluation by 14%
1968: US deep in Vietnam war, financed by the printing press
1971: Nixon increased 1 ounce of gold first to $38 then again to $42; Smithsonian agreement (Attempt to repair Bretton Woods agreements, Widening the band from 1% to 2.25%)
1972: EEC currencies tight bands (snake) died
1978/9: European monetary system was established; implementation of ERM
1992: Soros attack of the GBP, UK out of ERM
Feb 7 1992 The Maastricht Treaty replaced the old European Economic Community (EEC)
1993: Widening of bands from 2.25% to 15% (Currencies were effectively floating)
1997: Currency crisis in Asia (Starting in Thailand)
Jan 1999: First step in the implementation of Euro
</p>

<p>
2001: Turkish Lira Crisis
Mar 2002: Euro Finalized and implemented
2002 Argentine Peso Crisis
</p>
</div>
</div>

<div id="outline-container-org8a6abae" class="outline-2">
<h2 id="org8a6abae">Reference</h2>
<div class="outline-text-2" id="text-org8a6abae">
<p>
Shamah, S., 2001. A foreign exchange primer.
Wang, P., 2009. The economic of foreign exchange and global finance.
Weithers, T., 2011. Foreign exchange: a practical guide to the FX markets.
</p>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../categories/finance/" rel="tag">Finance</a></li>
            <li><a class="tag p-category" href="../../categories/fx/" rel="tag">FX</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../starting-an-application-with-a-specified-number-of-core/" rel="prev" title="Starting an application with a specified number of core">Previous post</a>
            </li>
        </ul></nav></aside><section class="comments hidden-print"><h2>Comments</h2>
        
        


        </section></article><!--End of body content--><footer id="footer">
            Contents © 2022         <a href="mailto:kelianferhat@gmail.com">Kelian</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
            
        </footer>
</div>
</div>


        <script src="../../assets/js/all-nocdn.js"></script><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element){var i=element.getElementsByTagName('img')[0];return i===undefined?'':i.alt;}});
    </script>
</body>
</html>
